Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Dlwov737CEZ1LaZi1A4dbQ8OnhUfgtIvqnxyNJ1L1Rewz++KFFdGITEjhFK5N5w4KjzpYZUs5ukW&#13;
AKoKquwbuMz9Qbuvpwy0t8wxu8vudjD70SvIekkMdmaVaA/korgKb8x+UcBRZ7JZseTz7iKWpj5w&#13;
wFoNxqkjHfkTKFQFFFXW6zm99C2rhVFelzrwNrcxKENnkwsGz0dB0H4EWkcrii7KuOQT87kwVdu1&#13;
u2k+V8rWAW+mEFjTwqT7aNbU/keM0rS6hTzUgndHXxY3ZS8fQGOwjnXdRDAvibUlS9abS9okYBpE&#13;
ux6yRScG7uZ/RfzDrdVOadXAeNT4YP/nEYVgSA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>ateIoxK3OOkJjjmw+Sb2wsvDbAiKiiYpyEOgn03pi3JVR2OABSOb51gCxcXfi96VowaQL/NQ+Kr9&#13;
FDaxwNrM2APWsiEEQR0kaCq5TgFJ+ro+92uGGUbw1agfPruXhOqzpS02aeQdl0akzjborRrx74zg&#13;
x4NWwEONo2K7UvPTbP6W5xtWxbaNnLvS4+R2bWt+NLVWiYGAwK5qU6dBhHJtR9INr4KjUyBuDD42&#13;
gcmnwOXSF3EESyHt2ThiNOWX3S2keR6xbx8xxfCFCHanPPfB8qOrJ7YSCY6KHhZGn927qiMaxMDZ&#13;
WjdSOkHdyH/OiEe7dSb+L9gaSRimeP1+V+wTNepSu7Oll+8+4nswCLcCdl+3tEEnhNwMJSBy7eQo&#13;
2nK+mSPRQMcIxfowPNkdix+Z9+WLvxrEBBYCMj3BaooJy4Oo5zShK3EMre4BHnYjXus8Ac/UrohG&#13;
1zfLpCiF/O4HG2xIXIEPMqlioDrF29c7XkadHJjpUImveIHnAZHhxP9ftyhiBHqUDc3kJ6gM2zpF&#13;
2xPYSURkS1/bTPjZ+wN7iAXiU25w3J0PNHOLeiznsLqf2kvSBOGENUqm2bLxPGN3/KulZKZJab1O&#13;
l/r79t4BxDShyIx+iWQeJMJ0WvoEKyJ1q2VLrr3ibEtAbtZjYU+h4VVXqW+VKJL1lnUqOTkCyuui&#13;
xh5LZH5UXBKcifxYB7B2G1nwVuFzdTk4Wg1ybP5RiVmks+GSn6fgjSFrjobg5faZwH1nBPAXjL9i&#13;
PwWI5AlL8iHnq9rpYozkIqpgr0412fcJFKgEqFWXa7eEfrAftOqVvbRJAR7uPDBCgmo4K5eqAwVW&#13;
IjT71X+XevBo5BaAQ0uK4NRM8R9vzDBgzcC5diyRirT0yDcnpLiDr4046cWTfnn916/SG86ZfbiS&#13;
WOpi8LorWtbZ97gwNCYXbaQ13ekI5fle8Vphc5i1KkaH1EgG7xsoaIbB2INptdwftK/7g+dqx3N5&#13;
qXE3</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>DCbfcSy7ELfZrdgHREMqYbGv3k0=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
V3o6l+Ef+NLbn69Sth/nPdBR8mbctu/wvgb/u019Z6evun3lIyav9nIxIp8KjmzCThX3x5I5prKK&#13;
0Lp1Ecm4p1PRkLcbdxONXUsAwEdPdH7JqtEDMhLwTBxwQpcOg7Y5DCJ2d0LX72imba3+iN+8ovep&#13;
A3Do1O1+2ZhlVtyKq5eaNDKF8dUdhi8/1Fh+LUQfA23I+/WM3YCBE3qREwTjJmbDuTvwbuUVh8MB&#13;
jVBRll0YcE4SO0SRPgfN/96QFw1Bh1gZl84u/+I8ukA+6tdN27jjTu+2JI97he3zwMk5kOiAk3yM&#13;
z//yCjcSclhpRUmFpfRmQ6nFJhpNj117CPdLpA==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>